Revit 2027 API
ItemFactoryBase.NewDimension Method
 Creates a new linear dimension object.
Overload List
Name | Description
NewDimension(View, Line, ReferenceArray) |  Creates a new linear dimension object using the default dimension style.
NewDimension(View, Line, ReferenceArray, DimensionType) |  Creates a new linear dimension object using the specified dimension style.
Top
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace